import type en from '../en';

const jwt_decoder = {
  title: 'เครื่องถอดรหัสและเข้ารหัส JWT (JWT decoder & encoder) | ปลอดภัย ง่ายดาย และใช้งานง่าย',
  description:
    'ถอดรหัสและเข้ารหัส JWT ได้อย่างรวดเร็วทางออนไลน์ และตรวจสอบลายเซ็นของมัน สำรวจตัวอย่าง JWT โดยใช้อัลกอริทึมต่าง ๆ พร้อมด้วยคำแนะนำในการใช้งาน JWT ทีละขั้นตอน',
  encoder: 'ตัวเข้ารหัส',
  decoder: 'ตัวถอดรหัส',
  subtitle: 'ข้อมูลของคุณเป็นส่วนตัว 100% -- JWT จะถูกถอดรหัสและเข้ารหัสโดยตรงบนอุปกรณ์ของคุณ',
  jwt_label: 'JWT',
  encoded_jwt_label: 'JWT ที่เข้ารหัส',
  decoded_header_label: 'ส่วนหัวที่ถอดรหัส',
  header_label: 'ส่วนหัว',
  decoded_payload_label: 'เพย์โหลดที่ถอดรหัส',
  payload_label: 'เพย์โหลด',
  signature_verified: 'ลายเซ็นยืนยันแล้ว!',
  invalid_signature: 'ลายเซ็นไม่ถูกต้อง!',
  jwt_editor_placeholder: 'วาง JWT ของคุณที่นี่',
  hmac_secret_placeholder: 'ใส่รหัส HMAC',
  public_key_placeholder: 'ใส่กุญแจสาธารณะที่นี่',
  private_key_placeholder: 'ใส่กุญแจส่วนตัวที่นี่',
  jwks_endpoint_uri_placeholder: 'ใส่ URL จุดบริการ JWKs',
  hmac_secret_label: 'กุญแจลงชื่อ',
  jwks_endpoint_uri_label: 'URI จุดบริการ JWKs',
  public_key_label: 'กุญแจสาธารณะ',
  private_key_label: 'กุญแจส่วนตัว',
  base64_encoded_label: 'เข้ารหัส Base64',
  jwks_endpoint_uri_link: 'URI จุดบริการ JWKs',
  public_key_link: 'ยืนยันผ่านกุญแจสาธารณะ',
  jwt_examples: 'ตัวอย่าง JWT',
  share_jwt: 'แชร์ JWT',
  copy_to_clipboard: 'URL ได้ถูกคัดลอกไปยังคลิปบอร์ด',
  instruction: {
    title: 'เรียนรู้เกี่ยวกับ JWT',
    subtitle:
      'ข้อมูลทั้งหมดที่คุณสนใจเกี่ยวกับ JWT และคำแนะนำทีละขั้นตอนในการยืนยัน JWT ในเฟรมเวิร์กที่หลากหลาย',
    what_is_jwt: {
      title: 'JWT คืออะไร?',
      description:
        'JWT (JSON Web Token) เป็นโทเค็นที่ไม่ต้องใช้เซิร์ฟเวอร์ในการตรวจสอบสถานะ ที่มีข้อมูลในรูปแบบที่มีโครงสร้างและอ่านได้ ไม่ว่าจะเป็นการปกป้อง API หรือการนำการตรวจสอบสิทธิ์โดยใช้โทเค็นสำหรับแอปพลิเคชันของคุณ JWT ถือเป็นเครื่องมือที่มีประสิทธิภาพ เพราะว่า:',
      bullets: [
        {
          label: 'ไม่ต้องใช้เซิร์ฟเวอร์',
          description:
            'JWT เป็นแบบพึ่งพาตนเองและไม่ต้องการสถานะเซิร์ฟเวอร์ในการตรวจสอบ JWT สามารถประกันความสมบูรณ์ของข้อมูลผ่านลายเซ็น',
        },
        {
          label: 'สามารถใช้งานร่วมกันระหว่างบริการ',
          description: 'JWT สามารถแบ่งปันและตรวจสอบได้อย่างง่ายดายระหว่างบริการต่างๆ',
        },
        {
          label: 'สามารถขยายได้',
          description:
            'เพย์โหลดของ JWT สามารถมีการเรียกร้องที่กำหนดเอง ทำให้สามารถตรวจสอบสิทธิ์และการแบ่งปันข้อมูลได้ยืดหยุ่น',
        },
      ],
    },
    jwt_structure: {
      title: 'โครงสร้างของ JWT',
      description:
        'JWT ทั่วไปจะถูกแบ่งออกเป็นสามส่วน แต่ละส่วนจะถูกเข้ารหัส Base64URL และแยกด้วยจุด (.)',
      bullets: [
        {
          label: 'ส่วนหัว',
          description:
            'มีเมทาดาต้า เช่น อัลกอริธึมลงชื่อ (เช่น HS256 หรือ RS256) และประเภทของโทเค็น (JWT)',
        },
        {
          label: 'เพย์โหลด',
          description: 'มีข้อมูลจริง เช่น รหัสผู้ใช้, โปรไฟล์ผู้ใช้, เวลาในการหมดอายุ หรือสโคป',
        },
        {
          label: 'ลายเซ็น',
          description:
            'การผสมผสานการแฮชของ ส่วนหัว, เพย์โหลด, และการรักษาความปลอดภัยโดยใช้กุญแจส่วนตัว จุดประสงค์เพื่อประกันความสมบูรณ์ของโทเค็นและยืนยันว่าไม่ได้ถูกแก้ไข',
        },
      ],
      summary:
        'โครงสร้างนี้ทำให้ JWT สามารถให้วิธีการที่กะทัดรัดและปลอดภัยในการส่งข้อมูลระหว่างคู่ค้าทั้งสองฝ่าย',
    },
    token_claims: {
      title: 'การเรียกร้องโทเค็นทั่วไปใน JWT',
      description:
        'การเรียกร้องเหล่านี้เป็นส่วนหนึ่งของเพย์โหลดและถือข้อมูลสำคัญ นี่คือการเรียกร้องที่ลงทะเบียนตามมาตรฐานที่ให้คุณอ้างอิง:',
      table: {
        headers: ['เรียกร้อง', 'ชื่อเต็ม', 'คำอธิบาย'],
        rows: [
          {
            claim: 'iss',
            full_name: 'ผู้ออก',
            description: 'หน่วยงานที่ออก JWT เช่น เซิร์ฟเวอร์ที่อนุญาต',
          },
          {
            claim: 'sub',
            full_name: 'หัวข้อ',
            description: 'ระบุหัวข้อของ JWT ซึ่งโดยปกติหมายถึงผู้ใช้ที่ได้รับการตรวจสอบสิทธิ์',
          },
          {
            claim: 'aud',
            full_name: 'ผู้รับฟัง',
            description:
              'ระบุว่าผู้รับจะรับและประมวลผลโทเค็นอย่างไร ซึ่งสามารถเป็นอาร์เรย์ของค่าสำหรับผู้รับหลายคนหรือค่าสำหรับผู้รับเดี่ยว',
          },
          {
            claim: 'exp',
            full_name: 'เวลาในการหมดอายุ',
            description:
              'กำหนดเวลาหมดอายุในโทเค็นหลังจากนั้นจะไม่สามารถใช้งานได้ ซึ่งนี้จะช่วยป้องกันการโจมตีซ้ำด้วยการกำหนดระยะเวลาการใช้งานของโทเค็น',
          },
          {
            claim: 'nbf',
            full_name: 'ไม่น้อยกว่า',
            description:
              'ทำให้โทเค็นมีผลตั้งแต่เวลาในเวลาเท่านั้น เข้มแข็งในสถานการณ์ที่ไม่มีการเข้าถึงนาฬิกา',
          },
          {
            claim: 'iat',
            full_name: 'เวลาที่ออก',
            description: 'เมื่อโทเค็นถูกสร้างขึ้น ซึ่งสามารถใช้เพื่อตรวจสอบอายุของโทเค็น',
          },
          {
            claim: 'jti',
            full_name: 'รหัส JWT',
            description:
              'ตัวระบุที่ไม่ซ้ำกันสำหรับโทเค็น ซึ่งมีประโยชน์ในการป้องกันการใช้โทเค็นเดียวกันซ้ำหลายครั้ง (เช่น ในการโจมตีซ้ำ)',
          },
        ],
      },
      other_token_claims: {
        description:
          'ขึ้นอยู่กับสเปคและการกำหนดค่าของเซิร์ฟเวอร์ที่อนุญาต อาจมีการรวมการเรียกร้องเพิ่มเติมในเพย์โหลดเพื่อสนับสนุนกรณีการใช้งานเฉพาะ นอกจากนี้ คุณสามารถเพิ่มการเรียกร้องที่กำหนดเองให้กับ JWT เพื่อตอบสนองข้อกำหนดทางธุรกิจเฉพาะเจาะจงได้',
        id_token: {
          title: 'โทเค็น ID',
          description:
            'ใช้ใน OpenID Connect, ประกอบด้วยการเรียกร้องต่างๆ เช่น ข้อมูลโปรไฟล์ (เช่น ชื่อ, อีเมล, เป็นต้น) เกี่ยวกับผู้ใช้ที่ได้รับการตรวจสอบสิทธิ์',
        },
        access_token: {
          title: 'โทเค็นการเข้าใช้งาน',
          description:
            'ใช้ใน OAuth 2.0, ช่วยให้ได้รับสิทธิ์ในการเข้าถึงทรัพยากรหรือ API เฉพาะในนามของผู้ใช้หรือแอปพลิเคชัน',
        },
      },
      notification: {
        label: 'คำเตือน',
        description:
          'อย่าเก็บข้อมูลส่วนตัวหรือข้อมูลที่อ่อนไหวในการเรียกร้อง JWT แม้ว่าการเรียกร้อง JWT จะถูกเข้ารหัส (โดยใช้ Base64URL) แต่ไม่ได้ถูกเข้ารหัส ซึ่งหมายความว่าใครก็ตามที่มีโทเค็นสามารถถอดรหัสและมองเห็นการเรียกร้องได้ ถึงแม้ว่าพวกเขาจะไม่สามารถเปลี่ยนแปลงได้โดยไม่ทำให้ลายเซ็นไม่ถูกต้อง ใช้การเข้ารหัสหรือวิธีการรักษาความปลอดภัยอื่นๆ เพื่อป้องกันข้อมูลที่อ่อนไหวเมื่อจำเป็น',
      },
    },
    when_to_use: {
      title: 'เมื่อไหร่ควรใช้ JWT?',
      description: 'JWT อาจมีประโยชน์โดยเฉพาะในการดำเนินการต่อไปนี้:',
      bullets: [
        {
          label: 'สถาปัตยกรรม Microservices',
          description: 'สำหรับการยืนยันสิทธิ์แบบไม่ใช้สถานะทั่วบริการหลายตัว',
        },
        {
          label: 'ระบบ Single Sign-On (SSO)',
          description: 'สามารถเข้าถึงแอปพลิเคชันหลายตัวได้ด้วยการตรวจสอบสิทธิ์เดียว',
        },
        {
          label: 'แอปพลิเคชันบนมือถือ',
          description: 'ทำให้การรักษาการจัดการเซสชั่นผู้ใช้มีประสิทธิภาพในการเรียก API',
        },
        {
          label: 'แอปพลิเคชันที่มีการเข้าถึงสูง',
          description: 'ลดภาระฐานข้อมูลในสภาพแวดล้อมที่มีปริมาณการใช้งานสูง',
        },
        {
          label: 'การแชร์ทรัพยากรระหว่างต้นทางต่างกัน (CORS)',
          description: 'ทำให้ง่ายต่อการตรวจสอบสิทธิ์ข้ามโดเมนหลายตัว',
        },
        {
          label: 'สถาปัตยกรรม Serverless',
          description:
            'ให้การยืนยันสิทธิ์แบบไม่ใช้สถานะที่การรักษาเซสเซ่นเซิร์ฟเวอร์เป็นสิ่งที่ท้าทาย',
        },
      ],
    },
    learn_more: 'เรียนรู้เพิ่มเติม',
  },
  verify_jwt: {
    title: 'วิธีการตรวจสอบ JWT?',
    subtitle:
      'ความสมบูรณ์ของ JWT จะต้องได้รับการตรวจสอบเพื่อยืนยันว่าข้อมูลหัวและเพย์โหลดไม่ได้ถูกดัดแปลง ด้านล่างนี้เป็นตัวอย่างทีละขั้นตอนได้จากการตรวจสอบ JWT ในสภาพแวดล้อมการพัฒนาโปรแกรมยอดนิยม:',
    ruby_label: 'ตรวจสอบ JWT ใน Ruby',
    dotnet_label: 'ตรวจสอบ JWT ใน .NET',
    java_label: 'ตรวจสอบ JWT ใน Java',
    php_label: 'ตรวจสอบ JWT ใน PHP',
    python_label: 'ตรวจสอบ JWT ใน Python',
    go_label: 'ตรวจสอบ JWT ใน Go',
    nodejs_label: 'ตรวจสอบ JWT ใน Node.js',
    rust_label: 'ตรวจสอบ JWT ใน Rust',
  },
  related_topics: {
    title: 'หัวข้อที่เกี่ยวข้องกับ JWT',
    subtitle:
      'ข้อมูลทั้งหมดที่คุณสนใจเกี่ยวกับ JWT และคำแนะนำทีละขั้นตอนในการยืนยัน JWT ในเฟรมเวิร์กที่หลากหลาย',
    blogs: {
      jwt_algorithm: {
        title: 'อัลกอริธึม JWT: EC vs. RSA',
        description:
          'เจาะลึกเข้าสู่เอกลักษณ์การเซ็นของ JWT เช่น EC และ RSA และเรียนรู้วิธีเลือกวิธีที่ปลอดภัยและมีประสิทธิภาพที่สุดสำหรับแอปพลิเคชันของคุณ',
      },
      id_token_and_access_token: {
        title: 'โทเค็น ID & โทเค็นการเข้าถึง & โทเค็นรีเฟรช',
        description:
          'คุณทราบถึงวัตถุประสงค์เฉพาะของโทเค็น ID, โทเค็นการเข้าถึง, และโทเค็นรีเฟรชหรือไม่? ทำความเข้าใจบทบาทของพวกเขาในกระบวนการตรวจสอบสิทธิ์และการอนุญาตจากมุมมองของ JWT',
      },
      custom_jwt_token_claims: {
        title: 'การเรียกร้องโทเค็น JWT ที่กำหนดเอง',
        description:
          'JWT ทำการควบคุมการเข้าถึงแบบละเอียดอย่างไร? เปรียบเทียบ RBAC (การควบคุมการเข้าถึงตามบทบาท) และ ABAC (การควบคุมการเข้าถึงตามคุณลักษณะ) เพื่อค้นหาวิธีแก้ปัญหาที่ดีที่สุดสำหรับแอปพลิเคชันของคุณ',
      },
      opaque_token_vs_jwt: {
        title: 'โทเค็นทึบแสง vs. โทเค็น JWT',
        description:
          'สำรวจความแตกต่างหลักระหว่างโทเค็นทึบแสงและ JWT และค้นพบว่าทำไม JWT ถึงกลายเป็นตัวเลือกที่ทันสมัยในการตรวจสอบสิทธิ์ด้วยประสิทธิภาพและความสามารถในการปรับขนาดสูง',
      },
      api_authorization: {
        title: 'การอนุมัติ API: คีย์ API vs. การตรวจสอบสิทธิ์พื้นฐาน vs. โทเค็น OAuth JWT',
        description:
          'สำรวจสามกลไกการอนุมัติ API ที่พบบ่อยพร้อมข้อดีและข้อเสียของพวกเขา เจาะลึกลงไปในแนวทางปฏิบัติที่ดีที่สุดเกี่ยวกับการปกป้อง API ของคุณโดยใช้โทเค็น OAuth JWT',
      },
      jwt_vs_session_authentication: {
        title: 'JWT vs. การตรวจสอบสิทธิ์ของเซสชัน',
        description:
          'การตรวจสอบสิทธิ์เซสชันแบบใช้เซิร์ฟเวอร์อาศัยการเก็บข้อมูลเซิร์ฟเวอร์เพื่อตรวจสอบเซสชันของผู้ใช้ ในขณะที่การตรวจสอบสิทธิ์แบบใช้โทเค็นเพิ่มการสื่อสารที่ไม่ใช้สถานะและปรับขนาดระหว่างลูกค้าและเซิร์ฟเวอร์ ค้นพบว่า JWT กำลังปฏิรูปการรักษาความปลอดภัย API และทำไมมันถึงกลายเป็นตัวเลือกที่ต้องการสำหรับการตรวจสอบสิทธิ์สมัยใหม่',
      },
      oauth_oidc_saml: {
        title: 'OAuth 2.0 & OIDC & SAML',
        description:
          'คำศัพท์ที่หรูหราเช่น OAuth, OpenID Connect (OIDC), SAML, SSO, และ JWT มักถูกใช้ในพื้นที่การจัดการอัตลักษณ์และการเข้าถึง (IAM) แต่พวกเขาหมายถึงอะไร? เปรียบเทียบเทคโนโลยีเหล่านี้และวิธีทำงานร่วมกัน',
      },
    },
  },
  unblock_more_subtitle:
    'ทำให้กระบวนการทำงานของคุณง่ายขึ้นและทำให้การจัดการผู้ใช้ปลอดภัยด้วย Logto Cloud ที่สร้างขึ้นบน OpenID Connect (OIDC) ซึ่งใช้ JWT เพื่อส่งมอบระบบการตรวจสอบสิทธิ์และการอนุญาตที่เชื่อถือได้ซึ่งออกแบบมาเพื่อขยายตามความต้องการของคุณ',
};

export default Object.freeze(jwt_decoder) satisfies typeof en;
